export const voteData = [
  [
    "Вопрос №1: Я полагаю, что мог бы внести большой вклад на такой работе, где:",
    "a) хорошая заработная плата и прочие виды вознаграждений",
    "b) имеется возможность установить хорошие взаимоотношения с коллегами по работе",
    "c) я мог бы влиять на принятие решений и демонстрировать свои достоинства как работника",
    "d) у меня есть возможность совершенствоваться и расти как личность",
  ],
  [
    "Вопрос №2: Я не хотел бы работать там, где:",
    "a) отсутствуют четкие указания, что от меня требуется",
    "b) практически отсутствуют обратная связь и оценка эффективности моей работы",
    "c) то, чем я занимаюсь, выглядит малополезным и малоценным",
    "d) плохие условия работы, слишком шумно или грязно",
  ],
  [
    "Вопрос №3: Для меня важно, чтобы моя работа:",
    "a) была связана со значительным разнообразием и переменами",
    "b) давала мне возможность работать с широким кругом людей",
    "c) обеспечивала мне четкие указания, чтобы я знал, что от меня требуется",
    "d) позволяла мне хорошо узнать тех людей, с кем я работаю",
  ],
  [
    "Вопрос №4: Я полагаю, что я не был бы очень заинтересован работой, которая:",
    "a) обеспечивала бы мне мало контактов с другими людьми",
    "b) едва ли была бы замечена другими людьми",
    "c) не имела бы конкретных очертаний, так что я не был бы уверен, что именно от меня требуется",
    "d) была бы сопряжена с определенным объемом рутинных операций",
  ],
  [
    "Вопрос №5: Работа мне нравится, если:",
    "a) я четко представляю себе, что от меня требуется",
    "b) у меня удобное рабочее место, и меня мало отвлекают",
    "c) у меня хорошие вознаграждение и заработная плата",
    "d) позволяет мне совершенствовать свои профессиональные качества",
  ],
  [
    "Вопрос №6: Полагаю, что мне бы понравилось, если:",
    "a) были бы хорошие условия работы и отсутствовало бы давление на меня",
    "b) у меня был бы очень хороший оклад",
    "c) работа в действительности была бы полезная и приносила мне удовлетворение",
    "d) мои достижения и работа оценивались бы по достоинству",
  ],
  [
    "Вопрос №7: Я считаю, что работа не должна:",
    "a) быть слабо структурированной, так что непонятно, что же следует делать",
    "b) предоставлять слишком мало возможностей хорошо узнать других людей",
    "c) быть малозначимой и малополезной для общества или неинтересной для выполнения",
    "d) оставаться непризнанной, а ее выполнение восприниматься как само собой разумеющееся",
  ],
  [
    "Вопрос №8: Работа, приносящая удовлетворение:",
    "a) связана со значительным разнообразием, переменами и стимуляцией энтузиазма",
    "b) дает возможность совершенствовать свои профессиональные качества и развиваться как личность",
    "c) является полезной и значимой для общества",
    "d) позволяет мне быть креативным (проявлять творческий подход) и экспериментировать с новыми идеями",
  ],
  [
    "Вопрос №9: Важно, чтобы работа:",
    "a) признавалась и ценилась организацией, в которой я работаю",
    "b) предоставляла возможности для персонального роста и совершенствования",
    "c) была сопряжена с большим разнообразием и переменами",
    "d) позволяла работнику оказывать влияние на других",
  ],
  [
    "Вопрос №10: Я считаю, что работа не будет приносить удовлетворение, если:",
    "a) в процессе ее выполнения мало возможностей осуществлять контакты с разными людьми",
    "b) оклад и вознаграждение не очень хорошие",
    "c) я не могу установить и поддерживать добрые отношения с коллегами по работе",
    "d) у меня очень мало самостоятельности или возможностей для проявления гибкости",
  ],
  [
    "Вопрос №11: Самой хорошей является такая работа, которая:",
    "a) обеспечивает хорошие рабочие условия",
    "b) дает четкие инструкции и разъяснения по поводу содержания работы",
    "c) предполагает выполнение интересных и полезных заданий",
    "d) позволяет получить признание личных достижений и качества работы",
  ],
  [
    "Вопрос №12: Вероятно, я не буду хорошо работать, если:",
    "a) имеется мало возможностей ставить перед собой цели и достигать их",
    "b) я не имею возможности совершенствовать свои личные качества",
    "c) тяжелая работа не получает признания и соответствующего вознаграждения",
    "d) на рабочем месте пыльно, грязно или шумно",
  ],
  [
    "Вопрос №13: При определении служебных обязанностей важно:",
    "a) дать людям возможность лучше узнать друг друга",
    "b) предоставить работнику возможность ставить цели и достигать их",
    "c) обеспечить условия для проявления работниками творческого начала",
    "d) обеспечить комфортность и чистоту места работы",
  ],
  [
    "Вопрос №14: Вероятно, я не захочу работать там, где:",
    "a) у меня будет мало самостоятельности и возможностей для совершенствования своей личности",
    "b) не поощряются исследования и проявление научного любопытства",
    "c) очень мало контактов с широким кругом людей",
    "d) отсутствуют достойные надбавки и дополнительные льготы",
  ],
  [
    "Вопрос №15: Я был бы удовлетворен, если:",
    "a) была бы возможность оказывать влияние на принятие решений другими работниками",
    "b) работа предоставляла бы широкое разнообразие и перемены",
    "c) мои достижения были бы оценены другими людьми",
    "d) я бы точно знал, что от меня требуется и как я должен это выполнять",
  ],
  [
    "Вопрос №16: Работа меньше удовлетворяла бы меня, если:",
    "a) не позволяла бы ставить сложные цели и добиваться их выполнения",
    "b) я бы не знал четких правил и процедур выполнения работы",
    "c) уровень оплаты моего труда не соответствовал бы уровню сложности выполняемой работы",
    "d) я практически не мог бы влиять на принимаемые решения и на то, что делают другие",
  ],
  [
    "Вопрос №17: Я полагаю, что руководство должно предоставить сотруднику:",
    "a) четкие должностные инструкции и указания на то, что от него требуется",
    "b) возможность лучше узнать своих коллег по работе",
    "c) возможности выполнять сложные производственные задания, требующие напряжения всех сил",
    "d) разнообразие, перемены и поощрения",
  ],
  [
    "Вопрос №18: Работа приносила бы меньше удовлетворения, если:",
    "a) не допускала бы возможности хотя бы небольшого творческого вклада",
    "b) осуществлялась бы изолированно, т.е. работник должен был бы работать в одиночестве",
    "c) отсутствовал бы благоприятный внутренний климат, в котором работник мог бы профессионально расти",
    "d) не давала бы возможности оказывать влияние на принятие решений",
  ],
  [
    "Вопрос №19: Я хотел бы работать там, где:",
    "a) другие люди признают и ценят выполняемую мной работу",
    "b) у меня будет возможность оказывать влияние на то, что делают другие",
    "c) имеется достойная система надбавок и дополнительных льгот",
    "d) можно выдвигать и апробировать новые идеи и проявлять креативность",
  ],
  [
    "Вопрос №20: Вряд ли я захотел бы работать там, где:",
    "a) не существует разнообразия или перемен в работе",
    "b) у меня будет мало возможностей влиять на принимаемые решения",
    "c) заработная плата не слишком высока",
    "d) условия работы недостаточно хорошие",
  ],
  [
    "Вопрос №21: Я полагаю, что приносящая удовлетворение работа должна предусматривать:",
    "a) наличие четких указаний, чтобы работники знали, что от них требуется",
    "b) возможность проявлять креативность",
    "c) возможность встречаться с интересными людьми",
    "d) чувство удовлетворения и действительно интересные задания",
  ],
  [
    "Вопрос №22: Работа не будет доставлять удовольствие, если:",
    "a) предусмотрены незначительные надбавки и дополнительные льготы",
    "b) условия работы некомфортны или в помещении очень шумно",
    "c) работник не имеет возможности сравнивать свою работу с работой других",
    "d) не поощряются исследования, творческий подход и новые идеи",
  ],
  [
    "Вопрос №23: Я считаю важным, чтобы работа обеспечивала мне:",
    "a) множество контактов с широким кругом интересных людей",
    "b) возможность установления и достижения целей",
    "c) возможность влиять на принятие решений",
    "d) высокий уровень заработной платы",
  ],
  [
    "Вопрос №24: Я не думаю, чтобы мне нравилась бы работа, если:",
    "a) условия работы некомфортны, на рабочем месте грязно или шумно",
    "b) мало шансов влиять на других людей",
    "c) мало возможностей для достижения поставленных целей",
    "d) я не мог бы проявлять креативность и предлагать новые идеи",
  ],
  [
    "Вопрос №25: В процессе организации работы важно:",
    "a) обеспечить чистоту и комфортность рабочего места",
    "b) создать условия для проявления работником самостоятельности",
    "c) предусмотреть возможность разнообразия и перемен",
    "d) обеспечить человеку широкие возможности контактов с другими людьми",
  ],
  [
    "Вопрос №26: Скорее всего я не захотел бы работать там, где:",
    "a) условия работы некомфортны, т.е. шумно или грязно и т.д",
    "b) мало возможностей осуществлять контакты с другими людьми",
    "c) работа не является интересной или полезной",
    "d) работа рутинная и задания редко меняются",
  ],
  [
    "Вопрос №27: Работа приносит удовлетворение, вероятно, когда:",
    "a) люди признают и ценят хорошо выполненную работу",
    "b) существуют широкие возможности для маневра и проявления гибкости",
    "c) можно ставить перед собой сложные и смелые цели",
    "d) существует возможность лучше узнать своих коллег",
  ],
  [
    "Вопрос №28: Мне бы не понравилась работа, которая:",
    "a) не была бы полезной и не приносила бы чувства удовлетворения",
    "b) не содержала бы в себе стимула к переменам",
    "c) не позволяла бы мне устанавливать дружеские отношения с другими",
    "d) была бы неконкретной и не ставила бы сложных задач",
  ],
  [
    "Вопрос №29: Я бы проявил стремление работать там, где:",
    "a) работа интересная и полезная",
    "b) люди могут устанавливать длительные дружеские взаимоотношения",
    "c) меня окружали бы интересные люди",
    "d) я мог бы оказывать влияние на принятие решений",
  ],
  [
    "Вопрос №30: Я считаю, что работа не должна:",
    "a) предусматривать, чтобы человек большую часть времени работал в одиночку",
    "b) давать мало шансов на признание личных достижений работника",
    "c) препятствовать установлению взаимоотношений с коллегами",
    "d) состоять в основном из рутинных обязанностей",
  ],
  [
    "Вопрос №31: Хорошо спланированная работа обязательно:",
    "a) предусматривает достаточный набор льгот и множество надбавок",
    "b) имеет четкие рекомендации по выполнению и должностные обязанности",
    "c) предусматривает возможность ставить цели и достигать их",
    "d) стимулирует и поощряет выдвижение новых идей",
  ],
  [
    "Вопрос №32: Я считал бы, что работа не приносит удовлетворения, если:",
    "a) я не мог бы выполнять сложную перспективную работу",
    "b) было бы мало возможностей для проявления креативности",
    "c) допускалась бы лишь малая доля самостоятельности",
    "d) сама суть работы не представлялась бы полезной или нужной",
  ],
  [
    "Вопрос №33: Наиболее важными характеристиками должности являются:",
    "a) возможность для творческого подхода и оригинального нестандартного мышления",
    "b) важные обязанности, выполнение которых приносит удовлетворение",
    "c) возможность устанавливать хорошие взаимоотношения с коллегами",
    "d) наличие значимых целей, которые призван достигать работник",
  ],
];

const container = document.querySelector(".voit__fieldset--questions");
for (let i = 0; i < voteData.length; i++) {
  const data = voteData[i];
  const template = (
    document.querySelector(".voit-template") as HTMLTemplateElement
  ).content.querySelector(".voit__list");
  const newItem = template.cloneNode(true) as HTMLElement;
  console.log(data, Array.isArray(data));
  newItem.querySelector(".voit__question").textContent = data[0];
  const inputs = newItem.querySelectorAll(".voit__input");
  inputs.forEach(
    (input: HTMLInputElement) => (input.name = (i + 1).toString())
  );
  newItem.querySelector(".voit__title--1").textContent = data[1];
  newItem.querySelector(".voit__title--2").textContent = data[2];
  newItem.querySelector(".voit__title--3").textContent = data[3];
  newItem.querySelector(".voit__title--4").textContent = data[4];
  container.appendChild(newItem);
}
